logitom/SmartHome_Sensor_V3.1.0/Middlewares/ST/Contiki_STM32_Library/Inc/st-lib.h
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/


/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* S2LP_PktBasic.h */

#define st_lib_pkt_basic_init                       PktBasicInit
#define st_lib_radio_qi_set_pqi_threshold(...)      SpiritQiSetPqiThreshold(__VA_ARGS__)
#define st_lib_radio_qi_get_pqi_threshold(...)      SpiritQiGetPqiThreshold(__VA_ARGS__)
#define st_lib_radio_qi_set_sqi_threshold(...)      SpiritQiSetSqiThreshold(__VA_ARGS__)
#define st_lib_radio_qi_get_sqi_threshold(...)      SpiritQiGetSqiThreshold(__VA_ARGS__)
#define st_lib_radio_qi_set_rssi_threshold(...)     SpiritQiSetRssiThreshold(__VA_ARGS__)
#define st_lib_radio_qi_get_rssi_threshold(...)     SpiritQiGetRssiThreshold(__VA_ARGS__)
#define st_lib_radio_qi_compute_rssi_threshold(...) SpiritQiComputeRssiThreshold(__VA_ARGS__)
#define st_lib_radio_qi_get_pqi(...)                SpiritQiGetPqi(__VA_ARGS__)
#define st_lib_radio_qi_get_sqi(...)                SpiritQiGetSqi(__VA_ARGS__)
#define st_lib_radio_qi_get_cs(...)                 SpiritQiGetCs(__VA_ARGS__)
#define st_lib_radio_qi_set_rssi_filter_gain(...)   SpiritQiSetRssiFilterGain(__VA_ARGS__)
#define st_lib_radio_qi_get_rssi_filter_gain(...)   SpiritQiGetRssiFilterGain(__VA_ARGS__)
#define st_lib_radio_qi_set_cs_mode(...)            SpiritQiSetCsMode(__VA_ARGS__)
#define st_lib_radio_qi_get_cs_mode(...)            SpiritQiGetCsMode(__VA_ARGS__)
#define st_lib_radio_qi_cs_timeout_mask(...)        SpiritQiCsTimeoutMask(__VA_ARGS__)
#define st_lib_radio_qi_pqi_timeout_mask(...)       SpiritQiPqiTimeoutMask(__VA_ARGS__)
#define st_lib_radio_qi_sqi_timeout_mask(...)       SpiritQiSqiTimeoutMask(__VA_ARGS__)
#define st_lib_irq_n_type                        IRQn_Type
#define st_lib_flag_status                       FlagStatus
#define st_lib_hal_nvic_enable_irq(...)           HAL_NVIC_EnableIRQ(__VA_ARGS__)
#define st_lib_hal_nvic_set_priority(...)         HAL_NVIC_SetPriority(__VA_ARGS__)
#define st_lib_hal_systick_clk_source_config(...) HAL_SYSTICK_CLKSourceConfig(__VA_ARGS__)
#define st_lib_hal_systick_config(...)            HAL_SYSTICK_Config(__VA_ARGS__)
#define st_lib_hal_rcc_get_hclk_freq(...)		  HAL_RCC_GetHCLKFreq(__VA_ARGS__)
#define st_lib_tim2_clk_enable(...)              __TIM2_CLK_ENABLE(__VA_ARGS__)
#define st_lib_tim5_clk_enable(...)              __TIM5_CLK_ENABLE(__VA_ARGS__)
#define st_lib_spi_handle_typedef                SPI_HandleTypeDef
#define st_lib_hal_spi_get_flag(...)             __HAL_SPI_GET_FLAG(__VA_ARGS__)
#define st_lib_hal_spi_transmit_receive(...)     HAL_SPI_TransmitReceive(__VA_ARGS__)
#define st_lib_tim_handle_typedef                TIM_HandleTypeDef
#define st_lib_tim_clock_config_typedef          TIM_ClockConfigTypeDef
#define st_lib_tim_oc_init_typedef               TIM_OC_InitTypeDef
#define st_lib_hal_tim_base_init(...)            HAL_TIM_Base_Init(__VA_ARGS__)
#define st_lib_hal_tim_base_start_it(...)        HAL_TIM_Base_Start_IT(__VA_ARGS__)
#define st_lib_hal_tim_config_clock_source(...)  HAL_TIM_ConfigClockSource(__VA_ARGS__)
#define st_lib_hal_tim_clear_flag(...)           __HAL_TIM_CLEAR_FLAG(__VA_ARGS__)
#define st_lib_hal_tim_clear_it(...)             __HAL_TIM_CLEAR_IT(__VA_ARGS__)
#define st_lib_hal_tim_enable(...)               __HAL_TIM_ENABLE(__VA_ARGS__)
#define st_lib_hal_tim_enable_it(...)            __HAL_TIM_ENABLE_IT(__VA_ARGS__)
#define st_lib_hal_tim_oc_init(...)              HAL_TIM_OC_Init(__VA_ARGS__)
#define st_lib_hal_tim_oc_config_channel(...)    HAL_TIM_OC_ConfigChannel(__VA_ARGS__)
#define st_lib_uart_handle_typedef               UART_HandleTypeDef
#define st_lib_hal_uart_enable_it(...)           __HAL_UART_ENABLE_IT(__VA_ARGS__)
#define st_lib_hal_uart_init(...)                HAL_UART_Init(__VA_ARGS__)
#define st_lib_hal_uart_receive(...)             HAL_UART_Receive(__VA_ARGS__)
#define st_lib_hal_uart_receive_it(...)          HAL_UART_Receive_IT(__VA_ARGS__)
#define st_lib_hal_uart_rx_cplt_callback(...)    HAL_UART_RxCpltCallback(__VA_ARGS__)
#define st_lib_hal_uart_transmit(...)            HAL_UART_Transmit(__VA_ARGS__)
#define st_lib_gpio_typedef                      GPIO_TypeDef
#define st_lib_bsp_led_init(...)                 BSP_LED_Init(__VA_ARGS__)
#define st_lib_bsp_led_off(...)                  BSP_LED_Off(__VA_ARGS__)
#define st_lib_bsp_led_on(...)                   BSP_LED_On(__VA_ARGS__)
#define st_lib_bsp_pb_init(...)                  BSP_PB_Init(__VA_ARGS__)
#define st_lib_bsp_pb_get_state(...)             BSP_PB_GetState(__VA_ARGS__)
#define st_lib_hal_gpio_read_pin(...)            HAL_GPIO_ReadPin(__VA_ARGS__)
#define st_lib_hal_gpio_write_pin(...)           HAL_GPIO_WritePin(__VA_ARGS__)
/*---------------------------------------------------------------------------*/

#if COMPILE_SENSORS
/*---------------------------------------------------------------------------*/
#ifdef USE_IKS01A1
#include "x_nucleo_iks01a1.h"
#include "x_nucleo_iks01a1_accelero.h"
#include "x_nucleo_iks01a1_gyro.h"
#include "x_nucleo_iks01a1_magneto.h"
#include "x_nucleo_iks01a1_humidity.h"
#include "x_nucleo_iks01a1_temperature.h"
#include "x_nucleo_iks01a1_pressure.h"
#else
#include "x_nucleo_iks01a2.h"
#include "x_nucleo_iks01a2_accelero.h"
#include "x_nucleo_iks01a2_gyro.h"
#include "x_nucleo_iks01a2_magneto.h"
#include "x_nucleo_iks01a2_humidity.h"
#include "x_nucleo_iks01a2_temperature.h"
#include "x_nucleo_iks01a2_pressure.h"
#endif /*USE_IKS01Ax*/

/* x_nucleo_iks01ax.h */
#define st_lib_sensor_axes_raw_t                SensorAxesRaw_t
#define st_lib_sensor_axes_t                    SensorAxes_t
/*---------------------------------------------------------------------------*/

