logitom/SmartHome_Sensor_V3.1.0/Middlewares/ST/Contiki_STM32_Library/Inc/st-lib.h
/*---------------------------------------------------------------------------*/
/* x_nucleo_iks01ax_temperature.h */

#define st_lib_bsp_temperature_init(...)           BSP_TEMPERATURE_Init(__VA_ARGS__)
#define st_lib_bsp_temperature_sensor_enable(...)  BSP_TEMPERATURE_Sensor_Enable(__VA_ARGS__)
#define st_lib_bsp_temperature_sensor_disable(...) BSP_TEMPERATURE_Sensor_Disable(__VA_ARGS__)
#define st_lib_bsp_temperature_is_initialized(...) BSP_TEMPERATURE_IsInitialized(__VA_ARGS__)
#define st_lib_bsp_temperature_get_temp(...)       BSP_TEMPERATURE_Get_Temp(__VA_ARGS__)
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* x_nucleo_iks01ax_humidity.h */

#define st_lib_bsp_humidity_init(...)           BSP_HUMIDITY_Init(__VA_ARGS__)
#define st_lib_bsp_humidity_sensor_enable(...)  BSP_HUMIDITY_Sensor_Enable(__VA_ARGS__)
#define st_lib_bsp_humidity_sensor_disable(...) BSP_HUMIDITY_Sensor_Disable(__VA_ARGS__)
#define st_lib_bsp_humidity_is_initialized(...) BSP_HUMIDITY_IsInitialized(__VA_ARGS__)
#define st_lib_bsp_humidity_get_hum(...)        BSP_HUMIDITY_Get_Hum(__VA_ARGS__)
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* x_nucleo_iks01ax_accelero.h */

#define st_lib_bsp_accelero_init(...)           BSP_ACCELERO_Init(__VA_ARGS__)
#define st_lib_bsp_accelero_sensor_enable(...)  BSP_ACCELERO_Sensor_Enable(__VA_ARGS__)
#define st_lib_bsp_accelero_sensor_disable(...) BSP_ACCELERO_Sensor_Disable(__VA_ARGS__)
#define st_lib_bsp_accelero_is_initialized(...) BSP_ACCELERO_IsInitialized(__VA_ARGS__)
#define st_lib_bsp_accelero_get_axes(...)       BSP_ACCELERO_Get_Axes(__VA_ARGS__)
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* x_nucleo_iks01ax_gyro.h */

#define st_lib_bsp_gyro_init(...)           BSP_GYRO_Init(__VA_ARGS__)
#define st_lib_bsp_gyro_sensor_enable(...)  BSP_GYRO_Sensor_Enable(__VA_ARGS__)
#define st_lib_bsp_gyro_sensor_disable(...) BSP_GYRO_Sensor_Disable(__VA_ARGS__)
#define st_lib_bsp_gyro_is_initialized(...) BSP_GYRO_IsInitialized(__VA_ARGS__)
#define st_lib_bsp_gyro_get_axes(...)       BSP_GYRO_Get_Axes(__VA_ARGS__)
/*---------------------------------------------------------------------------*/


/*---------------------------------------------------------------------------*/
/* x_nucleo_iks01ax_magneto.h */

#define st_lib_bsp_magneto_init(...)           BSP_MAGNETO_Init(__VA_ARGS__)
#define st_lib_bsp_magneto_sensor_enable(...)  BSP_MAGNETO_Sensor_Enable(__VA_ARGS__)
#define st_lib_bsp_magneto_sensor_disable(...) BSP_MAGNETO_Sensor_Disable(__VA_ARGS__)
#define st_lib_bsp_magneto_is_initialized(...) BSP_MAGNETO_IsInitialized(__VA_ARGS__)
#define st_lib_bsp_magneto_get_axes(...)       BSP_MAGNETO_Get_Axes(__VA_ARGS__)
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/* x_nucleo_iks01ax_pressure.h */

#define st_lib_bsp_pressure_init(...)            BSP_PRESSURE_Init(__VA_ARGS__)
#define st_lib_bsp_pressure_sensor_enable(...)   BSP_PRESSURE_Sensor_Enable(__VA_ARGS__)
#define st_lib_bsp_pressure_sensor_disable(...)  BSP_PRESSURE_Sensor_Disable(__VA_ARGS__)
#define st_lib_bsp_pressure_is_initialized(...)  BSP_PRESSURE_IsInitialized(__VA_ARGS__)
#define st_lib_bsp_pressure_get_press(...)       BSP_PRESSURE_Get_Press(__VA_ARGS__)
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/
#endif /*COMPILE_SENSORS*/
/*---------------------------------------------------------------------------*/

#ifdef X_NUCLEO_6180XA1
#include "x-nucleo-6180xa1.h"
#include "main.h"
#define st_lib_vl6180x_init(...)				Init_VL6180X_ProximitySens(__VA_ARGS__)//Proximity_Init(__VA_ARGS__)
#define st_lib_vl6180x_kickoff(...)				Kickoff_VL6180X_ProximitySen(__VA_ARGS__)
#define st_lib_vl6180x_get_range(...)				RdFligthSense_Distance(__VA_ARGS__)//Proximity_GetRange(__VA_ARGS__)
#endif
/*---------------------------------------------------------------------------*/
#endif /*ST_LIB_H_*/



/*---------------------------------------------------------------------------*/
/** @} */
